app/Http/Controllers/Homepage/RegisterController.php

select * from `registers` where `school_id` = 1 and `is_active` = 1 order by `name` asc
---
    public function config(Request $request, RegisterService $service)
    {
        $school_short = $request->query('school');

        if (! is_string($school_short) || trim($school_short) === '') {
            if (Auth::check()) {
                $user = Auth::user();
                $school = School::findOrFail($user->school_id);
                $school_short = $school->short_name;
            }
        }

        $app = 'Anmeldetool';

        $register_data = $service->checkLicenceAndSchool($school_short, $app);

        if ($register_data['status'] == 'error') {
            abort(403, $register_data['message']);
        }

        $isSchoolValid = $register_data['isSchoolValid'];
        $isLicenceValid = $register_data['isLicenceValid'];
        $school = $register_data['school'];
        $licence = $register_data['licence'];

        // Laden der Registers
        $registers = Register::where('school_id', $school->id)->where('is_active', 1)->orderBy('name')->get();