app/Http/Controllers/Homepage/TutoringController.php

    public function config()
    {
        $licenceName = 'Tutoring';

        $schools = School::where('is_selectable', 1)->whereHas('licences', function ($query) use ($licenceName) {
            $query->where('name', $licenceName)
                ->where('school_licences.valid_until', '>=', now());
        })->with(['licences' => function ($query) use ($licenceName) {
            $query->where('name', $licenceName)
                ->where('school_licences.valid_until', '>=', now());
        }])->get();
---
select * from `schools` where `is_selectable` = 1 and exists (select * from `licences` inner join `school_licences` on `licences`.`id` = `school_licences`.`licence_id` where `schools`.`id` = `school_licences`.`school_id` and `name` = 'Tutoring' and `school_licences`.`valid_until` >= '2025-11-23 10:29:48')
select `licences`.*, `school_licences`.`school_id` as `pivot_school_id`, `school_licences`.`licence_id` as `pivot_licence_id`, `school_licences`.`id` as `pivot_id`, `school_licences`.`valid_until` as `pivot_valid_until` from `licences` inner join `school_licences` on `licences`.`id` = `school_licences`.`licence_id` where `school_licences`.`school_id` in (1) and `name` = 'Tutoring' and `school_licences`.`valid_until` >= '2025-11-23 10:29:48'