app/Services/AdminService.php

    public function login($data)
    {
        $user = User::where('email', $data['email'])->where('school_id', $data['school']['id'])->first();
---
select * from `users` where `email` = 'kron@naturwelt.at' and `school_id` = 1 limit 1

    public function checkEmail($data): array
    {
        $users = User::where('email', $data['email'])->get();
        $data['users_count'] = $users->count();

        $ids = $users->pluck('school_id');

        $schools = School::whereIn('id', $ids)->orderBy('long_name')->get();
---
select * from `users` where `email` = 'sabine.widmann@cdgym.at'
select * from `schools` where `id` in (1) order by `long_name` asc

    public function check2Fa($data): array
    {
        $user = User::where('email', $data['email'])->where('school_id', $data['school']['id'])->first();
---
select * from `users` where `email` = 'sabine.widmann@cdgym.at' and `school_id` = 1 limit 1

    public function checkLogin($data): array
    {


        if (! $user = User::where('email', $data['email'])
            ->where('school_id', $data['school']['id'])
            ->first()) {
---
select * from `users` where `email` = 'kron@naturwelt.at' and `school_id` = 1 limit 1