app/Services/AdminNavigationService.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function dashboardMenu(): array
    {
        $menu = [];
        if (! Auth::check()) {
            return [];
        }

        $user = User::findOrFail(Auth::user()->id);