app/Services/HomepageRoutingService.php

select * from `schools` where `short_name` = 'CDGym' limit 1
---
    public function checkRoute($school_load, $licence_load)
    {

        $redirect = '/homepage';

        // Prüfen der Schule
        if ($school_load) {
            $school = School::where('short_name', $school_load)->first();