app/Services/LicenceService.php

select * from `licences` where `name` = 'Anmeldetool' limit 1
---
    public function licenceStatus($school, $app): string
    {
        if (! $school) {
            return 'missing';
        }

        $licence = Licence::where('name', $app)->first();