app/Services/RegisterService.php

select * from `schools` where `short_name` = 'CDGym' limit 1
select * from `licences` where `name` = 'Anmeldetool' limit 1
---
    public function checkLicenceAndSchool($school_short, $app): array
    {
        $licenceService = new LicenceService();

        // Prüfen, ob Schule existiert
        $isSchoolValid = ($school = School::where('short_name', $school_short)->first()) != null;

        // Prüfen, ob App-Lizenz existiert bzw. gültig ist
        $isLicenceValid = $licenceService->isLicenceValid($school, $app);

        if ($isLicenceValid) {
            $licence = Licence::where('name', $app)->first();