app/Services/SchoolService.php

insert into `schools` (`long_name`, `short_name`, `email`, `is_selectable`, `updated_at`, `created_at`) values ('Test', 'test', 'test@test.at', 1, '2025-11-20 20:12:32', '2025-11-20 20:12:32')
insert into `schoolyears` (`school_id`, `name`, `updated_at`, `created_at`) values (7, 'Schuljahr', '2025-11-20 20:12:32', '2025-11-20 20:12:32')
insert into `users` (`school_id`, `schoolyear_id`, `last_name`, `first_name`, `email`, `password`, `email_verified_at`, `confirmed_at`, `updated_at`, `created_at`) values (7, 28, 'Kron', 'Günther', 'kron@naturwelt.at', '$2y$12$Ij81xqeXKYh6EwBZuPY.d.TJjdiqTNu9ElFigsTtJiG7RD1Po4VXW', '2025-11-20 20:12:32', '2025-11-20 20:12:32', '2025-11-20 20:12:32', '2025-11-20 20:12:32')
---
    public function create($data)
    {
        // Merken falls upload_file gesetzt ist
        $path = $data['upload_file'] ?? null;
        unset($data['upload_file']);


        // Schule anlegen
        $school  = School::create($data);

        // Standard-Schuljahr anlegen
        $schoolyear = Schoolyear::create([
            'school_id' => $school->id,
            'name' => 'Schuljahr'
        ]);

        // Super-Admin anlegen
        $user = User::create([
            'school_id' => $school->id,
            'schoolyear_id' => $schoolyear->id,
            'last_name' => env('SA_LAST_NAME'),
            'first_name' => env('SA_FIRST_NAME'),
            'email' => env('SA_EMAIL'),
            'password' => env('SA_PW'),
            'email_verified_at' => now(),
            'confirmed_at' => now(),
        ]);

select exists(select * from `schools` where `id` = 9 and (select count(*) from `users` where `schools`.`id` = `users`.`school_id`) > 1) as `exists`
select * from `schools` where `schools`.`id` = 9 limit 1
delete from `school_licences` where `school_licences`.`school_id` = 9
delete from `users` where `id` = 1027
delete from `schools` where `id` = 5
delete from `schoolyears` where `school_id` = 9
delete from `schools` where `id` = 9
select * from `schools` where `schools`.`id` = 1 limit 1
---
    private function deleteSchool($id): bool
    {

        // Schule 1 kann nicht gelöscht werden (Big Boss Schule)
        if ($id == 1) return false;

        // Schule mit Registers kann nicht gelöscht werden
        if (School::where('id', $id)->has('registers')->exists()) return false;

        // Die Schule hat mehr User als nur den Super-Admin und kann daher nicht gelöscht werden
        if (School::where('id', $id)->has('users', '>', 1)->exists())  return false;

        $school = School::findOrFail($id);

        // Lizenzen löschen
        $school->licences()->detach();

        // Super-Admin löschen
        User::where('school_id', $id)->each(function ($user) {
            $user->syncRoles([]);   // removes all role assignments
            $user->delete();
        });


        // Schuljahr der Schule löschen
        Schoolyear::where('school_id', $id)->delete();

        // SchoolTool der Schule löschen
        SchoolTool::where('school_id', $id)->delete();

        // Schulen lösche
        $school = School::find($id);

select * from `schools` where `schools`.`id` = 1 limit 1
select `licences`.*, `school_licences`.`school_id` as `pivot_school_id`, `school_licences`.`licence_id` as `pivot_licence_id`, `school_licences`.`id` as `pivot_id`, `school_licences`.`valid_until` as `pivot_valid_until` from `licences` inner join `school_licences` on `licences`.`id` = `school_licences`.`licence_id` where `school_licences`.`school_id` = 1
---
    public function schoolInfos($school_id)
    {
        $licences = School::find($school_id)->licences->sortBy('name');

select * from `users` where `email` = 'kron@naturwelt.at'
select * from `schools` where `schools`.`id` in (1, 2)
select * from `users` where `id` in (1, 1042)
---
    public function loadSwitchableSchools($user)
    {

        $users = User::where('email', $user->email)->get();
        $ids = $users->pluck('id');

        $schools = User::whereIn('id', $ids)
            ->with('selectedSchool')
            ->get()
            ->pluck('selectedSchool')
            ->filter()
            ->unique('id')
            ->sortBy('long_name')
            ->values();