app/Services/TutoringService.php

    public function checkEmail($data)
    {
        // Prüft, ob die Email existiert
        // $data['status']
        // NEW_USER => neuen User anlegen
        // USER_FOUND => es existiert genau ein User in einer Schule
        $email = $data['email'];
        $user = User::where('school_id', $data['school_id'])->where('email', $email)->first();
---
select * from `users` where `school_id` = 1 and `email` = 'hallo@itstudio.at' limit 1

    public function assignTutoringRole($user_id): User
    {
        $user = User::findOrFail($user_id);
---
select * from `users` where `users`.`id` = 1035 limit 1

    public function confirmEmail($data)
    {
        // E-Mail-Verifikation
        $user_id = $data['user_id'];
        $user = User::findOrFail($user_id);

        if ($user->token_2fa == $data['token_2fa'] && $user->token_2fa_expires_at && $user->token_2fa_expires_at->isFuture()) {
            // Token ist noch gültig
            $user->email_verified_at = now();
            $user->save();
---
select * from `users` where `users`.`id` = 1037 limit 1
update `users` set `email_verified_at` = '2025-11-23 14:26:17', `users`.`updated_at` = '2025-11-23 14:26:17' where `id` = 1037

    public function checkUserConfirmation($data)
    {
        $user = User::findOrFail($data['user_id']);
---
select * from `users` where `users`.`id` = 1035 limit 1

        } else {
            // Keine Bestätigung notwendig ==> confirmed_at auf now() setzen
            $user->confirmed_at = now();
            $user->save();
---
update `users` set `confirmed_at` = '2025-11-23 14:14:24', `users`.`updated_at` = '2025-11-23 14:14:24' where `id` = 1035

    public function confirmUser($user_id, $uuid): bool
    {
        $user = User::findOrFail($user_id);
---
select * from `users` where `users`.`id` = '1035' limit 1

    public function checkLoginRequirement($data)
    {

        $user = User::findOrFail($data['user_id']);
---
select * from `users` where `users`.`id` = 1035 limit 1