app/Http/Controllers/Admin/Tutoring/SubjectController.php

select * from `tutoring_subjects` where `school_id` = 1 order by `short_name` asc
---
    public function index()
    {
        if (! $auth_user = $this->userHasRole(['admin', 'tutoring_admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }

        $subjects = TutoringSubject::where('school_id', $auth_user->school_id)->orderBy('short_name')->get();