app/Http/Controllers/Admin/AdminController.php

    public function loadRoles(Request $request)
    {
        if (! $auth_user = $this->userHasRole(['super_admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }

        $roles = DB::table('roles')->orderBy('name')->get();
---
select * from `roles` order by `name` asc