app/Http/Controllers/Admin/HealthController.php

insert into `queue_tests` (`user_id`, `status`, `dispatched_at`, `id`, `updated_at`, `created_at`) values (1, 'dispatched', '2025-11-22 19:56:29', '7a08bf2d-3149-44ed-be1d-14ea86b8aa70', '2025-11-22 19:56:29', '2025-11-22 19:56:29')
---
    public function testQueue()
    {
        $user = Auth::user();

        // Create test record
        $queueTest = QueueTest::create([
            'user_id' => $user->id,
            'status' => 'dispatched',
            'dispatched_at' => now()
        ]);

select * from `queue_tests` where `id` = 'e94c5a34-2c10-4d40-b03c-096febbe5a14' and `user_id` = 1 limit 1
---
    public function checkQueueStatus(Request $request)
    {

        $testId = $request->test_id;
        $queueTest = QueueTest::where('id', $testId)
            ->where('user_id', Auth::id())
            ->first();