app/Http/Controllers/Admin/LicenceController.php

select * from `licences` order by `long_name` asc
---
    public function loadLicences()
    {
        if (! $auth_user = $this->userHasRole(['super_admin', 'admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }

        $licences = Licence::orderBy('long_name')->get();