app/Http/Controllers/Admin/RegisterController.php

select `id`, `name` from `schoolyears` where `schoolyears`.`id` in (1)
---
    public function getActiveRegisters()
    {
        if (! $auth_user = $this->userHasRole(['admin', 'register_admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }

        $school_id = $auth_user->school_id;

        $registers = Register::select('registers.*')
            ->join('schoolyears', 'schoolyears.id', '=', 'registers.schoolyear_id')
            ->where('registers.school_id', $school_id)
            ->where('registers.is_active', 1)
            ->orderBy('schoolyears.name', 'desc')
            ->orderBy('registers.name')
            ->with(['schoolyear:id,name'])
            ->withCount([
                'bookings',
                'dates',
                'dates as different_dates_count' => function ($q) {
                    $q->select(DB::raw('COUNT(DISTINCT date)'));
                },
            ])
            ->get();

insert into `registers` (`name`, `max_registrations`, `is_active`, `show_phone`, `must_phone`, `show_student_last_name`, `must_student_last_name`, `show_student_first_name`, `must_student_first_name`, `show_student_birthdate`, `must_student_birthdate`, `school_id`, `schoolyear_id`, `updated_at`, `created_at`) values ('BNG Zauner Anmeldetool', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 12, '2025-11-21 08:30:08', '2025-11-21 08:30:08')
---
    public function store(RegisterStoreRequest $request)
    {
        if (! $auth_user = $this->userHasRole(['admin', 'register_admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }
        $validated = $request->validated();
        $validated['school_id'] = $auth_user->school_id;
        $validated['schoolyear_id'] = $auth_user->schoolyear_id;

        // HTML sanitizen - nur erlaubte Tags zulassen
        if (isset($validated['description_on_website'])) {
            $validated['description_on_website'] = strip_tags(
                $validated['description_on_website'],
                '<p><br><strong><b><u><em><i>'
            );
        }

        $register = Register::create($validated);