app/Http/Controllers/Admin/RegisterDateController.php

select * from `register_dates` where `register_id` = 7 and `date` = '2025-11-17' order by `from` asc, `supervisor` asc
---
    public function index(RegisterDateIndexRequest $request)
    {

        if (! $auth_user = $this->userHasRole(['admin', 'register_admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }

        $register_id = $auth_user->register_id;
        $validated = $request->validated();
        $date = $validated['date'];

        $registerDates = RegisterDate::where('register_id', $register_id)->where('date', $date)->orderBy('from')->orderBy('supervisor')->get();