app/Http/Controllers/Admin/RoleController.php

    public function loadRoles()
    {

        if (! $auth_user = $this->userHasRole(['super_admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }

        $roles = Role::orderBy('name')->get();
---
select * from `roles` order by `name` asc