app/Http/Controllers/Admin/SchoolToolController.php

select * from `school_tools` where `school_tools`.`id` = 1 limit 1
---
    public function loadConfig(Request $request)
    {
        if (! $auth_user = $this->userHasRole(['admin', 'tutoring_admin', 'register_admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }
        $schoolTool = SchoolTool::findOrFail(1);