app/Http/Controllers/Admin/UserController.php

select * from `users` where `school_id` = 1 order by `last_name` asc, `first_name` asc limit 30 offset 0
select count(*) as aggregate from `users` where `school_id` = 1
---
    public function loadUsers(UserIndexRequest $request)
    {
        if (! $auth_user = $this->userHasRole(['super_admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }

        $validated = $request->validated();
        $search_string = $validated['search_string'] ?? null;

        $role = $validated['role'] ?? null;

        $users = User::query()
            ->where('school_id', $auth_user->school_id)
            ->when($search_string, function ($query, $search_string) {
                $query->where(function ($q) use ($search_string) {
                    $q->where('last_name', 'like', "%{$search_string}%")
                        ->orWhere('first_name', 'like', "%{$search_string}%")
                        ->orWhere('email', 'like', "%{$search_string}%");
                });
            })
            ->when($role, function ($query, $role) {
                $query->role($role); // Spatie Permission Methode
            })
            ->orderBy('last_name')
            ->orderBy('first_name')
            ->paginate(config('schooltool.pagination'));

select * from `users` where `users`.`id` = 515 limit 1
update `users` set `is_active` = 0, `users`.`updated_at` = '2025-11-28 17:53:33' where `id` = 515
---
    public function toggleIsActive(Request $request, AdminService $service)
    {
        if (! $auth_user = $this->userHasRole(['super_admin'])) {
            abort(403, 'Sie haben keine Berechtigung');
        }

        $validated = $request->validate([
            'user_id' => 'required|integer|exists:users,id',
        ]);

        $user = User::findOrFail($validated['user_id']);
        $user->is_active = !$user->is_active;
        $user->save();